# Id Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalNode..::..Id Property
MEPAnalyticalNode Class See Also
---
The identity used in the MEPAnalyticalSegment
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public int Id { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Id As Integer
	Get
```

Visual C++
---
```text
public:
property int Id {
	int get ();
}
```

# See Also
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace